#include <iostream>

void contex(){
    std::cout << "--------------------------------------------------------------------------------" << std::endl;
    std::cout << "|                                        Menu                                  |" << std::endl;
    std::cout << "--------------------------------------------------------------------------------" << std::endl;
    std::cout << "|                                       Task_1                                 |" << std::endl;
    std::cout << "|                                 Вариант 16 - 15 = 1                          |" << std::endl;
    std::cout << "|                                     Выполнил:                                |" << std::endl;
    std::cout << "|                              Стецко Ярослав Юрьевич                          |" << std::endl;
    std::cout << "|                                   Суть задания:                              |" << std::endl;
    std::cout << "|  Преобразовать массив следующим образом: все отрицательные элементы массива  |" << std::endl;
    std::cout << "|    перенести в начало, сохранив исходное взаимное расположение, как среди    |" << std::endl;
    std::cout << "|         отрицательных, так и среди остальных элементов массива               |" << std::endl;
    std::cout << "--------------------------------------------------------------------------------" << std::endl;
}

int main(){
    contex();
    char ret;
    do{
        int arr[10];

        std::cout <<"Введите 10 элементов массива: ";
        for(int i = 0; i < 10; i++){ //ввод массива
            std::cin >> arr[i];
        }

        int arr2[10], c = 0; 
        
        for(int i = 0; i < 10; i++){ //добавляем сначала числа меньше нуля
            if(arr[i] < 0){
                arr2[c] = arr[i];
                c++; //с - сохраняет индекс для следующего числа в новом массиве
            }
        }
        for(int i = 0; i < 10; i++){ //добавляем неотрицательные числа
            if(arr[i] >= 0){
                arr2[c] = arr[i];
                c++;
            }
        }

        for(int i = 0; i < 10; i++){  //вывод итогового массива
            std::cout << arr2[i] << " "; 
        }

        std::cout << std::endl;
        std::cout << "Желаете продолжить?(y/n):";
        do{
            std::cin >> ret;
            if (ret != 'y' && ret != 'n'){
                std::cin.clear(); 
                std::cin.ignore(32767,'\n');
                std::cout << "Некорректный ввод, желаете продолжить?(y/n): ";
            }
        }
        while(ret != 'y' && ret != 'n');    
        if(ret == 'y') system("cls");
    }
    while(ret == 'y');
    return 0;
}